app/views/orders/_form.html.erb

    <%= form.label :sender_id %>
    <%= form.collection_select :sender_id, User.order(created_at: :desc), :id, :full_name, include_blank: false %>
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC

    <%= form.label :receiver_id %>
    <%= form.collection_select :receiver_id, User.order(created_at: :desc), :id, :full_name, include_blank: false %>
---
SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC