app/views/orders/index.html.erb

SELECT "orders".* FROM "orders" WHERE (order_id LIKE '%6bCY3VBdMQbEFIVqUVpQog%')
---
        <td><%= order.receiver.email %></td>
        <td><%= order.order_id %></td>