app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE (order_id LIKE '%qrtriZdSIg1PvkebWkYVxw%')
SELECT "orders".* FROM "orders"
---
  def index
    @orders = if params[:order_id].present?
                Order.where('order_id LIKE ?', "%#{params[:order_id]}%")
              else
                Order.all

INSERT INTO "orders" ("weight", "service_type", "service_cost", "payment_mode", "sender_id", "receiver_id", "order_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
  def create
    @order = Order.new(order_params)
    respond_to do |format|
      if @order.save

UPDATE "orders" SET "status" = $1, "receiver_id" = $2, "updated_at" = $3 WHERE "orders"."id" = $4  [["status", 1], ["receiver_id", "cdc339e8-dc11-4cfe-9a33-9c872ab61120"], ["updated_at", "2021-09-15 12:21:11.830196"], ["id", "ef436967-21f6-419f-ba38-c1e3ff3c2dac"]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)