app/controllers/users_controller.rb

INSERT INTO "users" ("full_name", "address", "mobile_number", "pin_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["full_name", "ASP"], ["address", "Manipal"], ["mobile_number", "1234567890"], ["pin_code", "576104"], ["created_at", "2021-09-14 15:53:32.621955"], ["updated_at", "2021-09-14 15:53:32.621955"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save